am/OpenFOAM-10/tutorials/multiphase/interFoam/laminar/containerDischarge2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid 0
);

regions
(
    boxToCell
    {
        box (-100 -100 0.0) (100 100 0.05);
        fieldValues
        (
            volScalarFieldValue alpha.liquid 1
        );
    }
);


// ************************************************************************* //
